{
  "photographicStyle": {
    "name": "Ethereal Dream with Cinematic Motion",
    "overallAesthetic": {
      "primaryDescriptors": [
        "Ethereal",
        "Dreamlike",
        "Cinematic",
        "Romantic",
        "Nostalgic",
        "Luminous",
        "Radiant"
      ],
      "secondaryDescriptors": [
        "Soft-Focus",
        "Painterly",
        "Analog Emulation",
        "Sun-drenched",
        "Fantastical",
        "Introspective"
      ],
      "moodAndFeeling": "This style evokes the poignant feeling of a fleeting, cherished memory. It's deeply cinematic, romantic, and introspective, wrapping the scene in a luminous, dream-like haze. The mood is one of gentle melancholy, serene nostalgia, and the quiet beauty found in a captured moment. The entire visual language is designed to feel like a beautiful, half-forgotten dream.",
      "artisticInfluence": "Draws from the visual language of arthouse cinema (e.g., Terrence Malick), the soft-focus romanticism of Pictorialist photography, the light-obsessed paintings of J.M.W. Turner, and the characteristic imperfections of aged 35mm film stock."
    },
    "lightingAndExposure": {
      "qualityOfLight": "The lighting is the protagonist. It's tangible, soft, and glowing, mimicking a powerful, low sun during a hazy golden hour. The light wraps around subjects, spills into shadows, and fills the atmosphere.",
      "exposureTechnique": "Intentionally high-key. Highlights are consistently and stylistically blown out to create an intense, radiant bloom, sacrificing detail for an overwhelming sense of light and emotion.",
      "bloomAndHalation": {
        "description": "An extremely pronounced and pervasive glow where bright light sources and highlights bleed extensively into all surrounding areas. This creates a soft, hazy aura around subjects and edges, unifying the scene in a luminous fog.",
        "intensity": "Very high, a core and non-negotiable feature of the aesthetic."
      },
      "sunRaysAndGodRays": {
        "description": "Vibrant, distinct shafts of volumetric light ('god rays') are a crucial element, especially in environments with atmospheric particles (dust, mist, rain). They slice through the scene, guiding the eye and adding a magical, divine quality.",
        "vibrancy": "Extremely vibrant, glowing with the intense warmth of the primary light source."
      },
      "shadowsAndBlacks": "Shadows are always lifted, soft, and filled with cool-toned light. Absolute black is forbidden. The darkest tones are rendered as a deep cyan, teal, or slate blue, ensuring no part of the image feels empty or harsh."
    },
    "colorGrading": {
      "overallPalette": "A sophisticated split-toned palette with a powerful push-pull between warm, radiant highlights and deep, cool shadows.",
      "highlights": {
        "hues": "Intensely warm, creamy, and golden. Tones of radiant yellow, soft peach, and pale orange dominate, often tinged with magenta or lavender in the brightest areas of bloom.",
        "saturation": "High, to convey the intensity of the light source."
      },
      "shadows": {
        "hues": "Consistently and richly cool-toned. Shadows are filled with cyan, teal, or a muted Prussian blue, providing a deep, cinematic contrast to the warmth of the highlights.",
        "saturation": "Moderate to high, making the color contrast a definitive statement."
      }
    },
    "lensAndOpticalEffects": {
      "sharpnessAndFocus": "A profound overall softness. The image lacks any hint of clinical digital sharpness. The plane of focus is narrow and rendered with a gentle, creamy quality.",
      "depthOfField": {
        "characteristics": "Extremely shallow depth of field. This is a critical component for subject isolation. The focus falloff is rapid and smooth, melting the background and foreground into an abstract wash of color and light.",
        "bokeh": "The out-of-focus areas ('bokeh') are rendered as soft, creamy, and often dream-like orbs of light, free of harsh edges. The bokeh should contribute to the painterly quality of the background, creating beautiful, abstract shapes.",
        "effectOnScene": "This technique forces the viewer's attention onto the subject, creating a powerful sense of intimacy and introspection. The blurred environment provides emotional context through color and light rather than sharp detail."
      },
      "vignetting": "A heavy, yet natural, vignette is applied. The corners are significantly darkened and often desaturated or cooled, creating a 'spotlight' effect on the center of the frame and enhancing the feeling of peering into a memory.",
      "lensFlareAndAberration": "Prominent, soft, anamorphic-style lens flares (streaks and hazy orbs) are encouraged. Chromatic aberration (purple and green fringing) on high-contrast edges is exaggerated to enhance the vintage, imperfect quality."
    },
    "compositionAndDynamics": {
      "compositionalTechniques": "Composition must be intentional and evocative, avoiding static, centered shots. Prioritize techniques like: the Rule of Thirds for off-center subject placement; intense use of Negative Space to create a sense of scale or isolation; strong Leading Lines (roads, railings, rays of light) to guide the eye; and Natural Framing (using doorways, windows, arches, or foliage) to create a sense of depth and voyeurism.",
      "subjectPlacementAndGaze": "Subjects should be placed in an interesting relationship with their environment. They are often looking away from the camera, towards a light source, or out into the distance, suggesting deep thought, longing, or contemplation. The gaze is a key narrative tool. Poses should be natural and unforced, capturing a 'moment in-between'.",
      "cameraAngles": "Employ unconventional camera angles to enhance the cinematic feel. Low-angle shots make the subject feel heroic or the environment vast. High-angle shots can create a sense of vulnerability or provide an observational viewpoint. A subtle Dutch Angle (slight tilt) can be used to introduce a feeling of dreamlike unease or dynamism.",
      "motionAndDynamics": {
        "description": "The image should feel like a single frame from a motion picture, not a static photograph. This is achieved by artistically incorporating motion blur.",
        "environmentalMotionBlur": "Background or foreground elements are often rendered with motion blur. For example, falling rain should appear as elegant streaks, passing city lights as long trails of color, and wind-swept leaves as a soft blur. This contrasts with the relative stillness of the subject, adding life and dynamism.",
        "subjectMotionBlur": "Subtle motion blur can be applied to parts of the subject, such as the flowing fabric of a dress, a hand gesturing, or hair blowing in the wind. This technique captures the essence of movement and prevents the image from feeling frozen in time.",
        "panningBlur": "For moving subjects (like a person walking or a vehicle), a panning motion blur effect should be used, where the subject remains relatively sharp while the background is streaked horizontally, conveying a strong sense of speed and direction."
      }
    },
    "textureAndDetail": {
      "filmGrainAndNoise": {
        "description": "A visible but fine film grain (emulating 35mm, 400 ISO film stock) is applied across the entire image. It adds a tactile, organic texture and is crucial for the analog aesthetic. The grain should be most noticeable in the midtones.",
        "characteristics": "The grain should not look like digital noise; it must have an organic, varied structure."
      },
      "clarityAndDefinition": "Clarity and texture are deliberately reduced globally to enhance the soft, painterly feel. Fine details are suppressed in favor of broad strokes of color and light."
    }
  }
}